no_contact_or_file = 'Телефонная книга пуста или не открыта!'

load_successful = 'Телефонная книга успешно загружена!'
save_successful = 'Телефонная книга успешно сохранена!'
new_contact_successful = 'Контакт успешно создан!'
edit_contact_successful = 'Контак изменён успешно'
delete_contact_successful = 'Контак удалён успешно'

new_name = 'Введине имя и фамилию контакта: '
new_phone = 'Введине телефон контакта: '
new_comment = 'Введине коментарий контакта: '

is_change = 'Были внесены изменения, сохранить?'

search_request = 'Введине данные для поиска контакта: '
search_edit_contact = 'Введине данные для поиска редактируемого контакта: '
repeat_search = 'Уточните поисковый запрос: '
search_delete_contact = 'Введине данные для поиска удалаяемого контакта: '

edit_field_coich = ''' 1. ФИО 2. Номер телефона 3. Коментарий
Выберите поле для редактирования: '''

overflow_search = 'количество найденных контактов более одного!'


bye = 'До свидания!'